PinguinoIDE/pinguino-compilers/windows64/p8/share/gputils/header/p18f96j94.inc
;----- MEMCON Bits -----------------------------------------------------
EBDIS            EQU  H'0007'

WM0_MEMCON       EQU  H'0000'
WM1_MEMCON       EQU  H'0001'
WAIT0            EQU  H'0004'
WAIT1            EQU  H'0005'


;----- PORTL Bits -----------------------------------------------------
RL0              EQU  H'0000'
RL1              EQU  H'0001'
RL2              EQU  H'0002'
RL3              EQU  H'0003'
RL4              EQU  H'0004'
RL5              EQU  H'0005'
RL6              EQU  H'0006'
RL7              EQU  H'0007'


;----- LATL Bits -----------------------------------------------------
LATL0            EQU  H'0000'
LATL1            EQU  H'0001'
LATL2            EQU  H'0002'
LATL3            EQU  H'0003'
LATL4            EQU  H'0004'
LATL5            EQU  H'0005'
LATL6            EQU  H'0006'
LATL7            EQU  H'0007'


;----- TRISL Bits -----------------------------------------------------
TRISL0           EQU  H'0000'
TRISL1           EQU  H'0001'
TRISL2           EQU  H'0002'
TRISL3           EQU  H'0003'
TRISL4           EQU  H'0004'
TRISL5           EQU  H'0005'
TRISL6           EQU  H'0006'
TRISL7           EQU  H'0007'


;----- PORTK Bits -----------------------------------------------------
RK0              EQU  H'0000'
RK1              EQU  H'0001'
RK2              EQU  H'0002'
RK3              EQU  H'0003'
RK4              EQU  H'0004'
RK5              EQU  H'0005'
RK6              EQU  H'0006'
RK7              EQU  H'0007'


;----- LATK Bits -----------------------------------------------------
LATK0            EQU  H'0000'
LATK1            EQU  H'0001'
LATK2            EQU  H'0002'
LATK3            EQU  H'0003'
LATK4            EQU  H'0004'
LATK5            EQU  H'0005'
LATK6            EQU  H'0006'
LATK7            EQU  H'0007'


;----- TRISK Bits -----------------------------------------------------
TRISK0           EQU  H'0000'
TRISK1           EQU  H'0001'
TRISK2           EQU  H'0002'
TRISK3           EQU  H'0003'
TRISK4           EQU  H'0004'
TRISK5           EQU  H'0005'
TRISK6           EQU  H'0006'
TRISK7           EQU  H'0007'


;----- ODCON2 Bits -----------------------------------------------------
ECCP3OD          EQU  H'0000'
CCP4OD           EQU  H'0001'
CCP5OD           EQU  H'0002'
CCP6OD           EQU  H'0003'
CCP7OD           EQU  H'0004'
CCP8OD           EQU  H'0005'
CCP9OD           EQU  H'0006'
CCP10OD          EQU  H'0007'


;----- ODCON1 Bits -----------------------------------------------------
SSP1OD           EQU  H'0000'
SSP2OD           EQU  H'0001'
USART1OD         EQU  H'0002'
USART2OD         EQU  H'0003'
USART3OD         EQU  H'0004'
USART4OD         EQU  H'0005'
ECCP1OD          EQU  H'0006'
ECCP2OD          EQU  H'0007'


;----- MDCARL Bits -----------------------------------------------------
MDCLSYNC         EQU  H'0005'
MDCLPOL          EQU  H'0006'
MDCLODIS         EQU  H'0007'

MDCL0            EQU  H'0000'
MDCL1            EQU  H'0001'
MDCL2            EQU  H'0002'
MDCL3            EQU  H'0003'


;----- MDCARH Bits -----------------------------------------------------
MDCHSYNC         EQU  H'0005'
MDCHPOL          EQU  H'0006'
MDCHODIS         EQU  H'0007'

MDCH0            EQU  H'0000'
MDCH1            EQU  H'0001'
MDCH2            EQU  H'0002'
MDCH3            EQU  H'0003'


;----- MDSRC Bits -----------------------------------------------------
MDSODIS          EQU  H'0007'

MDSRC0           EQU  H'0000'
MDSRC1           EQU  H'0001'
MDSRC2           EQU  H'0002'
MDSRC3           EQU  H'0003'


;----- MDCON Bits -----------------------------------------------------
MDBIT            EQU  H'0000'
MDO              EQU  H'0003'
MDOPOL           EQU  H'0004'
MDSLR            EQU  H'0005'
MDOE             EQU  H'0006'
MDEN             EQU  H'0007'


;----- PMD4 Bits -----------------------------------------------------
EMBMD            EQU  H'0000'
LVDMD            EQU  H'0002'
IOCMD            EQU  H'0003'
USBMD            EQU  H'0004'
CMP3MD           EQU  H'0005'
CMP2MD           EQU  H'0006'
CMP1MD           EQU  H'0007'


;----- PMD3 Bits -----------------------------------------------------
REFO2MD          EQU  H'0000'
REFO1MD          EQU  H'0001'
PSPMD            EQU  H'0002'
LCDMD            EQU  H'0003'
RTCCMD           EQU  H'0004'
ADCMD            EQU  H'0005'
CTMUMD           EQU  H'0006'
MODMD            EQU  H'0007'

TXMMD            EQU  H'0007'


;----- PMD2 Bits -----------------------------------------------------
TMR0MD           EQU  H'0000'
TMR1MD           EQU  H'0001'
TMR2MD           EQU  H'0002'
TMR3MD           EQU  H'0003'
TMR4MD           EQU  H'0004'
TMR5MD           EQU  H'0005'
TMR6MD           EQU  H'0006'
TMR8MD           EQU  H'0007'


;----- PMD1 Bits -----------------------------------------------------
SSP1MD           EQU  H'0000'
SSP2MD           EQU  H'0001'
UART1MD          EQU  H'0002'
UART2MD          EQU  H'0003'
UART3MD          EQU  H'0004'
UART4MD          EQU  H'0005'
ECCP1MD          EQU  H'0006'
ECCP2MD          EQU  H'0007'


;----- PMD0 Bits -----------------------------------------------------
ECCP3MD          EQU  H'0000'
CCP4MD           EQU  H'0001'
CCP5MD           EQU  H'0002'
CCP6MD           EQU  H'0003'
CCP7MD           EQU  H'0004'
CCP8MD           EQU  H'0005'
CCP9MD           EQU  H'0006'
CCP10MD          EQU  H'0007'


;----- CTMUCON4 Bits -----------------------------------------------------
EDG1STAT         EQU  H'0000'
EDG2STAT         EQU  H'0001'
EDG1POL          EQU  H'0006'
EDG1EN           EQU  H'0007'

EDG1SEL0         EQU  H'0002'
EDG1SEL1         EQU  H'0003'
EDG1SEL2         EQU  H'0004'
EDG1SEL3         EQU  H'0005'


;----- CTMUCON3 Bits -----------------------------------------------------
EDG2POL          EQU  H'0006'
EDG2EN           EQU  H'0007'

EDG2SEL0         EQU  H'0002'
EDG2SEL1         EQU  H'0003'
EDG2SEL2         EQU  H'0004'
EDG2SEL3         EQU  H'0005'


;----- CTMUCON2 Bits -----------------------------------------------------
IRNG0            EQU  H'0000'
IRNG1            EQU  H'0001'
ITRIM0           EQU  H'0002'
ITRIM1           EQU  H'0003'
ITRIM2           EQU  H'0004'
ITRIM3           EQU  H'0005'
ITRIM4           EQU  H'0006'
ITRIM5           EQU  H'0007'


;----- CTMUCON1 Bits -----------------------------------------------------
CTTRIG           EQU  H'0000'
IDISSEN          EQU  H'0001'
EDGSEQEN         EQU  H'0002'
EDGEN            EQU  H'0003'
TGEN             EQU  H'0004'
CTMUSIDL         EQU  H'0005'
CTMUEN           EQU  H'0007'


;----- SPBRG4 Bits -----------------------------------------------------
BRG0             EQU  H'0000'
BRG1             EQU  H'0001'
BRG2             EQU  H'0002'
BRG3             EQU  H'0003'
BRG4             EQU  H'0004'
BRG5             EQU  H'0005'
BRG6             EQU  H'0006'
BRG7             EQU  H'0007'


;----- SPBRGH4 Bits -----------------------------------------------------
BRG8             EQU  H'0000'
BRG9             EQU  H'0001'
BRG10            EQU  H'0002'
BRG11            EQU  H'0003'
BRG12            EQU  H'0004'
BRG13            EQU  H'0005'
BRG14            EQU  H'0006'
BRG15            EQU  H'0007'


;----- BAUDCON4 Bits -----------------------------------------------------
ABDEN            EQU  H'0000'
WUE              EQU  H'0001'
IREN             EQU  H'0002'
BRG16            EQU  H'0003'
TXCKP            EQU  H'0004'
RXDTP            EQU  H'0005'
RCIDL            EQU  H'0006'
ABDOVF           EQU  H'0007'


;----- TXSTA4 Bits -----------------------------------------------------
TX9D             EQU  H'0000'
TRMT             EQU  H'0001'
BRGH             EQU  H'0002'
SENDB            EQU  H'0003'
SYNC             EQU  H'0004'
TXEN             EQU  H'0005'
TX9              EQU  H'0006'
CSRC             EQU  H'0007'


;----- RCSTA4 Bits -----------------------------------------------------
RX9D             EQU  H'0000'
OERR             EQU  H'0001'
FERR             EQU  H'0002'
ADDEN            EQU  H'0003'
CREN             EQU  H'0004'
SREN             EQU  H'0005'
RX9              EQU  H'0006'
SPEN             EQU  H'0007'


;----- DMACON2 Bits -----------------------------------------------------
INTLVL0          EQU  H'0000'
INTLVL1          EQU  H'0001'
INTLVL2          EQU  H'0002'
INTLVL3          EQU  H'0003'
DLYCYC0          EQU  H'0004'
DLYCYC1          EQU  H'0005'
DLYCYC2          EQU  H'0006'
DLYCYC3          EQU  H'0007'


