PinguinoIDE/pinguino-compilers/windows64/p8/share/gputils/header/p18f96j94.inc
;==========================================================================
;
;       RAM Definitions
;
;==========================================================================
       __MAXRAM  H'0FFF'
       __BADRAM  H'0DFA'-H'0DFE'
       __BADRAM  H'0FD4'

;==========================================================================
;
;   IMPORTANT: For the PIC18 devices, the __CONFIG directive has been
;              superseded by the CONFIG directive.  The following settings
;              are available for this device.
;
;   Stack Overflow/Underflow Reset:
;     STVREN = OFF         Disabled
;     STVREN = ON          Enabled
;
;   Extended Instruction Set:
;     XINST = OFF          Disabled
;     XINST = ON           Enabled
;
;   Brown-Out Reset Enable:
;     BOREN = OFF          Disabled in hardware
;     BOREN = ON           Controlled with SBOREN bit, disabled in Deep Sleep
;
;   Brown-out Reset Voltage:
;     BORV = 0             2.0V
;     BORV = 1             1.8V
;
;   Code Protect:
;     CP0 = ON             Program memory is code-protected
;     CP0 = OFF            Program memory is not code-protected
;
;   Oscillator:
;     FOSC = FRC           Fast RC Oscillator (FRC)
;     FOSC = FRCPLL        Fast RC Oscillator with PLL module (FRCPLL)
;     FOSC = PRI           Primary Oscillator (XT, HS, EC)
;     FOSC = PRIPLL        Primary Oscillator with PLL module (XTPLL,HSPLL,ECPLL)
;     FOSC = SOSC          Secondary Oscillator (SOSC)
;     FOSC = LPRC          Low-Power RC Oscillator (LPRC)
;     FOSC = FRC500KHZ     Fast RC Oscillator divided by 16 (500 kHz)
;     FOSC = FRCDIV        Fast RC Oscillator with Postscaler (FRCDIV)
;
;   T1OSC/SOSC Power Selection Bits:
;     SOSCSEL = DIG        Digital (SCLKI) mode
;     SOSCSEL = LOW        Low Power T1OSC/SOSC circuit selected
;
;   Clock Out Enable Bit:
;     CLKOEN = OFF         CLKO output disabled on the RA6 pin
;     CLKOEN = ON          CLKO output enabled on the RA6 pin
;
;   Internal External Oscillator Switch Over Mode:
;     IESO = OFF           Disabled
;     IESO = ON            Enabled
;
;   PLL Frequency Multiplier Select bits:
;     PLLDIV = NODIV       96 MHz PLL selected; No divide - Oscillator used directly (4 MHz input)
;     PLLDIV = DIV2        96 MHz PLL selected; Oscillator divided by 2 (8 MHz input)
;     PLLDIV = DIV3        96 MHz PLL selected; Oscillator divided by 3 (12 MHz input)
;     PLLDIV = DIV4        96 MHz PLL selected; Oscillator divided by 4 (16 MHz input)
;     PLLDIV = DIV5        96 MHz PLL selected; Oscillator divided by 5 (20 MHz input)
;     PLLDIV = DIV6        96 MHz PLL selected; Oscillator divided by 6 (24 MHz input)
;     PLLDIV = DIV10       96 MHz PLL selected; Oscillator divided by 10 (40 MHz input)
;     PLLDIV = DIV12       96 MHz PLL selected; Oscillator divided by 12 (48 MHz input)
;     PLLDIV = RESERVED    RESERVED
;     PLLDIV = RESERVED    RESERVED
;     PLLDIV = RESERVED    RESERVED
;     PLLDIV = RESERVED    RESERVED
;     PLLDIV = PLL4X       4x PLL selected
;     PLLDIV = PLL6X       6x PLL selected
;     PLLDIV = PLL8X       8x PLL selected
;     PLLDIV = NOPLL       No PLL used - PLLGO bit not available to user
;
;   Primary Oscillator Select:
;     POSCMD = EC          External clock mode selected
;     POSCMD = MS          MS oscillator mode selected(3.5 MHz -10 MHz)
;     POSCMD = HS          HS oscillator mode selected(10 MHz - 40 MHz)
;     POSCMD = NONE        Primary oscillator disabled
;
;   Clock Switching and Monitor Selection Configuration bits:
;     FSCM = CSECME        Clock switching is enabled, fail safe clock monitor is enabled
;     FSCM = CSECMD        Clock switching is enabled, fail safe clock monitor is disabled
;     FSCM = CSDCMD        Clock switching is disabled, fail safe clock monitor is disabled
;
;   Write/Erase Protect Page Start/End Boundary:
;     WPFP = WPFP0         Write Protect Program Flash Page 0
;     WPFP = WPFP1         Write Protect Program Flash Page 1
;     WPFP = WPFP2         Write Protect Program Flash Page 2
;     WPFP = WPFP3         Write Protect Program Flash Page 3
;     WPFP = WPFP4         Write Protect Program Flash Page 4
;     WPFP = WPFP5         Write Protect Program Flash Page 5
;     WPFP = WPFP6         Write Protect Program Flash Page 6
;     WPFP = WPFP7         Write Protect Program Flash Page 7
;     WPFP = WPFP8         Write Protect Program Flash Page 8
;     WPFP = WPFP9         Write Protect Program Flash Page 9
;     WPFP = WPFP10        Write Protect Program Flash Page 10
;     WPFP = WPFP11        Write Protect Program Flash Page 11
;     WPFP = WPFP12        Write Protect Program Flash Page 12
;     WPFP = WPFP13        Write Protect Program Flash Page 13
;     WPFP = WPFP14        Write Protect Program Flash Page 14
;     WPFP = WPFP15        Write Protect Program Flash Page 15
;     WPFP = WPFP16        Write Protect Program Flash Page 16
;     WPFP = WPFP17        Write Protect Program Flash Page 17
;     WPFP = WPFP18        Write Protect Program Flash Page 18
;     WPFP = WPFP19        Write Protect Program Flash Page 19
;     WPFP = WPFP20        Write Protect Program Flash Page 20
;     WPFP = WPFP21        Write Protect Program Flash Page 21
;     WPFP = WPFP22        Write Protect Program Flash Page 22
;     WPFP = WPFP23        Write Protect Program Flash Page 23
;     WPFP = WPFP24        Write Protect Program Flash Page 24
;     WPFP = WPFP25        Write Protect Program Flash Page 25
;     WPFP = WPFP26        Write Protect Program Flash Page 26
;     WPFP = WPFP27        Write Protect Program Flash Page 27
;     WPFP = WPFP28        Write Protect Program Flash Page 28
;     WPFP = WPFP29        Write Protect Program Flash Page 29
;     WPFP = WPFP30        Write Protect Program Flash Page 30
;     WPFP = WPFP31        Write Protect Program Flash Page 31
;     WPFP = WPFP32        Write Protect Program Flash Page 32
;     WPFP = WPFP33        Write Protect Program Flash Page 33
;     WPFP = WPFP34        Write Protect Program Flash Page 34
;     WPFP = WPFP35        Write Protect Program Flash Page 35
;     WPFP = WPFP36        Write Protect Program Flash Page 36
;     WPFP = WPFP37        Write Protect Program Flash Page 37
;     WPFP = WPFP38        Write Protect Program Flash Page 38
;     WPFP = WPFP39        Write Protect Program Flash Page 39
;     WPFP = WPFP40        Write Protect Program Flash Page 40
;     WPFP = WPFP41        Write Protect Program Flash Page 41
;     WPFP = WPFP42        Write Protect Program Flash Page 42
;     WPFP = WPFP43        Write Protect Program Flash Page 43
;     WPFP = WPFP44        Write Protect Program Flash Page 44
;     WPFP = WPFP45        Write Protect Program Flash Page 45
;     WPFP = WPFP46        Write Protect Program Flash Page 46
;     WPFP = WPFP47        Write Protect Program Flash Page 47
;     WPFP = WPFP48        Write Protect Program Flash Page 48
;     WPFP = WPFP49        Write Protect Program Flash Page 49
;     WPFP = WPFP50        Write Protect Program Flash Page 50
;     WPFP = WPFP51        Write Protect Program Flash Page 51
;     WPFP = WPFP52        Write Protect Program Flash Page 52
;     WPFP = WPFP53        Write Protect Program Flash Page 53
;     WPFP = WPFP54        Write Protect Program Flash Page 54
;     WPFP = WPFP55        Write Protect Program Flash Page 55
;     WPFP = WPFP56        Write Protect Program Flash Page 56
;     WPFP = WPFP57        Write Protect Program Flash Page 57
;     WPFP = WPFP58        Write Protect Program Flash Page 58
;     WPFP = WPFP59        Write Protect Program Flash Page 59
;     WPFP = WPFP60        Write Protect Program Flash Page 60
;     WPFP = WPFP61        Write Protect Program Flash Page 61
;     WPFP = WPFP62        Write Protect Program Flash Page 62
;     WPFP = WPFP63        Write Protect Program Flash Page 63
;     WPFP = WPFP64        Write Protect Program Flash Page 64
;     WPFP = WPFP65        Write Protect Program Flash Page 65
;     WPFP = WPFP66        Write Protect Program Flash Page 66
;     WPFP = WPFP67        Write Protect Program Flash Page 67
;     WPFP = WPFP68        Write Protect Program Flash Page 68
;     WPFP = WPFP69        Write Protect Program Flash Page 69
;     WPFP = WPFP70        Write Protect Program Flash Page 70
;     WPFP = WPFP71        Write Protect Program Flash Page 71
;     WPFP = WPFP72        Write Protect Program Flash Page 72
;     WPFP = WPFP73        Write Protect Program Flash Page 73
;     WPFP = WPFP74        Write Protect Program Flash Page 74
;     WPFP = WPFP75        Write Protect Program Flash Page 75
;     WPFP = WPFP76        Write Protect Program Flash Page 76
;     WPFP = WPFP77        Write Protect Program Flash Page 77
;     WPFP = WPFP78        Write Protect Program Flash Page 78
;     WPFP = WPFP79        Write Protect Program Flash Page 79
;     WPFP = WPFP80        Write Protect Program Flash Page 80
;     WPFP = WPFP81        Write Protect Program Flash Page 81
;     WPFP = WPFP82        Write Protect Program Flash Page 82
;     WPFP = WPFP83        Write Protect Program Flash Page 83
;     WPFP = WPFP84        Write Protect Program Flash Page 84
;     WPFP = WPFP85        Write Protect Program Flash Page 85
;     WPFP = WPFP86        Write Protect Program Flash Page 86
;     WPFP = WPFP87        Write Protect Program Flash Page 87
;     WPFP = WPFP88        Write Protect Program Flash Page 88
;     WPFP = WPFP89        Write Protect Program Flash Page 89
;     WPFP = WPFP90        Write Protect Program Flash Page 90
;     WPFP = WPFP91        Write Protect Program Flash Page 91
;     WPFP = WPFP92        Write Protect Program Flash Page 92
;     WPFP = WPFP93        Write Protect Program Flash Page 93
;     WPFP = WPFP94        Write Protect Program Flash Page 94
;     WPFP = WPFP95        Write Protect Program Flash Page 95
;     WPFP = WPFP96        Write Protect Program Flash Page 96
;     WPFP = WPFP97        Write Protect Program Flash Page 97
;     WPFP = WPFP98        Write Protect Program Flash Page 98
;     WPFP = WPFP99        Write Protect Program Flash Page 99
;     WPFP = WPFP100       Write Protect Program Flash Page 100
;     WPFP = WPFP101       Write Protect Program Flash Page 101
;     WPFP = WPFP102       Write Protect Program Flash Page 102
;     WPFP = WPFP103       Write Protect Program Flash Page 103
;     WPFP = WPFP104       Write Protect Program Flash Page 104
;     WPFP = WPFP105       Write Protect Program Flash Page 105
;     WPFP = WPFP106       Write Protect Program Flash Page 106
;     WPFP = WPFP107       Write Protect Program Flash Page 107
;     WPFP = WPFP108       Write Protect Program Flash Page 108
;     WPFP = WPFP109       Write Protect Program Flash Page 109
;     WPFP = WPFP110       Write Protect Program Flash Page 110
;     WPFP = WPFP111       Write Protect Program Flash Page 111
;     WPFP = WPFP112       Write Protect Program Flash Page 112
;     WPFP = WPFP113       Write Protect Program Flash Page 113
;     WPFP = WPFP114       Write Protect Program Flash Page 114
;     WPFP = WPFP115       Write Protect Program Flash Page 115
;     WPFP = WPFP116       Write Protect Program Flash Page 116
;     WPFP = WPFP117       Write Protect Program Flash Page 117
;     WPFP = WPFP118       Write Protect Program Flash Page 118
;     WPFP = WPFP119       Write Protect Program Flash Page 119
;     WPFP = WPFP120       Write Protect Program Flash Page 120
;     WPFP = WPFP121       Write Protect Program Flash Page 121
;     WPFP = WPFP122       Write Protect Program Flash Page 122
;     WPFP = WPFP123       Write Protect Program Flash Page 123
;     WPFP = WPFP124       Write Protect Program Flash Page 124
;     WPFP = WPFP125       Write Protect Program Flash Page 125
;     WPFP = WPFP126       Write Protect Program Flash Page 126
;     WPFP = WPFP127       Write Protect Program Flash Page 127
;     WPFP = WPFP128       Write Protect Program Flash Page 128
;     WPFP = WPFP129       Write Protect Program Flash Page 129
;     WPFP = WPFP130       Write Protect Program Flash Page 130
;     WPFP = WPFP131       Write Protect Program Flash Page 131
;     WPFP = WPFP132       Write Protect Program Flash Page 132
;     WPFP = WPFP133       Write Protect Program Flash Page 133
;     WPFP = WPFP134       Write Protect Program Flash Page 134
;     WPFP = WPFP135       Write Protect Program Flash Page 135
;     WPFP = WPFP136       Write Protect Program Flash Page 136
;     WPFP = WPFP137       Write Protect Program Flash Page 137
;     WPFP = WPFP138       Write Protect Program Flash Page 138
;     WPFP = WPFP139       Write Protect Program Flash Page 139
;     WPFP = WPFP140       Write Protect Program Flash Page 140
;     WPFP = WPFP141       Write Protect Program Flash Page 141
;     WPFP = WPFP142       Write Protect Program Flash Page 142
;     WPFP = WPFP143       Write Protect Program Flash Page 143
;     WPFP = WPFP144       Write Protect Program Flash Page 144
;     WPFP = WPFP145       Write Protect Program Flash Page 145
;     WPFP = WPFP146       Write Protect Program Flash Page 146
;     WPFP = WPFP147       Write Protect Program Flash Page 147
;     WPFP = WPFP148       Write Protect Program Flash Page 148
;     WPFP = WPFP149       Write Protect Program Flash Page 149
;     WPFP = WPFP150       Write Protect Program Flash Page 150
;     WPFP = WPFP151       Write Protect Program Flash Page 151
;     WPFP = WPFP152       Write Protect Program Flash Page 152
;     WPFP = WPFP153       Write Protect Program Flash Page 153
;     WPFP = WPFP154       Write Protect Program Flash Page 154
;     WPFP = WPFP155       Write Protect Program Flash Page 155
;     WPFP = WPFP156       Write Protect Program Flash Page 156
;     WPFP = WPFP157       Write Protect Program Flash Page 157
;     WPFP = WPFP158       Write Protect Program Flash Page 158
;     WPFP = WPFP159       Write Protect Program Flash Page 159
;     WPFP = WPFP160       Write Protect Program Flash Page 160
;     WPFP = WPFP161       Write Protect Program Flash Page 161
;     WPFP = WPFP162       Write Protect Program Flash Page 162
;     WPFP = WPFP163       Write Protect Program Flash Page 163
;     WPFP = WPFP164       Write Protect Program Flash Page 164
;     WPFP = WPFP165       Write Protect Program Flash Page 165
;     WPFP = WPFP166       Write Protect Program Flash Page 166
;     WPFP = WPFP167       Write Protect Program Flash Page 167
;     WPFP = WPFP168       Write Protect Program Flash Page 168
;     WPFP = WPFP169       Write Protect Program Flash Page 169
;     WPFP = WPFP170       Write Protect Program Flash Page 170
;     WPFP = WPFP171       Write Protect Program Flash Page 171
;     WPFP = WPFP172       Write Protect Program Flash Page 172
;     WPFP = WPFP173       Write Protect Program Flash Page 173
;     WPFP = WPFP174       Write Protect Program Flash Page 174
;     WPFP = WPFP175       Write Protect Program Flash Page 175
;     WPFP = WPFP176       Write Protect Program Flash Page 176
;     WPFP = WPFP177       Write Protect Program Flash Page 177
;     WPFP = WPFP178       Write Protect Program Flash Page 178
;     WPFP = WPFP179       Write Protect Program Flash Page 179
;     WPFP = WPFP180       Write Protect Program Flash Page 180
;     WPFP = WPFP181       Write Protect Program Flash Page 181
;     WPFP = WPFP182       Write Protect Program Flash Page 182
;     WPFP = WPFP183       Write Protect Program Flash Page 183
;     WPFP = WPFP184       Write Protect Program Flash Page 184
;     WPFP = WPFP185       Write Protect Program Flash Page 185
;     WPFP = WPFP186       Write Protect Program Flash Page 186
;     WPFP = WPFP187       Write Protect Program Flash Page 187
;     WPFP = WPFP188       Write Protect Program Flash Page 188
;     WPFP = WPFP189       Write Protect Program Flash Page 189
;     WPFP = WPFP190       Write Protect Program Flash Page 190
;     WPFP = WPFP191       Write Protect Program Flash Page 191
;     WPFP = WPFP192       Write Protect Program Flash Page 192
;     WPFP = WPFP193       Write Protect Program Flash Page 193
;     WPFP = WPFP194       Write Protect Program Flash Page 194
;     WPFP = WPFP195       Write Protect Program Flash Page 195
;     WPFP = WPFP196       Write Protect Program Flash Page 196
;     WPFP = WPFP197       Write Protect Program Flash Page 197
;     WPFP = WPFP198       Write Protect Program Flash Page 198
;     WPFP = WPFP199       Write Protect Program Flash Page 199
;     WPFP = WPFP200       Write Protect Program Flash Page 200
;     WPFP = WPFP201       Write Protect Program Flash Page 201
;     WPFP = WPFP202       Write Protect Program Flash Page 202
;     WPFP = WPFP203       Write Protect Program Flash Page 203
;     WPFP = WPFP204       Write Protect Program Flash Page 204
;     WPFP = WPFP205       Write Protect Program Flash Page 205
;     WPFP = WPFP206       Write Protect Program Flash Page 206
;     WPFP = WPFP207       Write Protect Program Flash Page 207
;     WPFP = WPFP208       Write Protect Program Flash Page 208
;     WPFP = WPFP209       Write Protect Program Flash Page 209
;     WPFP = WPFP210       Write Protect Program Flash Page 210
;     WPFP = WPFP211       Write Protect Program Flash Page 211
;     WPFP = WPFP212       Write Protect Program Flash Page 212
;     WPFP = WPFP213       Write Protect Program Flash Page 213
;     WPFP = WPFP214       Write Protect Program Flash Page 214
;     WPFP = WPFP215       Write Protect Program Flash Page 215
;     WPFP = WPFP216       Write Protect Program Flash Page 216
;     WPFP = WPFP217       Write Protect Program Flash Page 217
;     WPFP = WPFP218       Write Protect Program Flash Page 218
;     WPFP = WPFP219       Write Protect Program Flash Page 219
;     WPFP = WPFP220       Write Protect Program Flash Page 220
;     WPFP = WPFP221       Write Protect Program Flash Page 221
;     WPFP = WPFP222       Write Protect Program Flash Page 222
;     WPFP = WPFP223       Write Protect Program Flash Page 223
;     WPFP = WPFP224       Write Protect Program Flash Page 224
;     WPFP = WPFP225       Write Protect Program Flash Page 225
;     WPFP = WPFP226       Write Protect Program Flash Page 226
;     WPFP = WPFP227       Write Protect Program Flash Page 227
;     WPFP = WPFP228       Write Protect Program Flash Page 228
;     WPFP = WPFP229       Write Protect Program Flash Page 229
;     WPFP = WPFP230       Write Protect Program Flash Page 230
;     WPFP = WPFP231       Write Protect Program Flash Page 231
;     WPFP = WPFP232       Write Protect Program Flash Page 232
;     WPFP = WPFP233       Write Protect Program Flash Page 233
;     WPFP = WPFP234       Write Protect Program Flash Page 234
;     WPFP = WPFP235       Write Protect Program Flash Page 235
;     WPFP = WPFP236       Write Protect Program Flash Page 236
;     WPFP = WPFP237       Write Protect Program Flash Page 237
;     WPFP = WPFP238       Write Protect Program Flash Page 238
;     WPFP = WPFP239       Write Protect Program Flash Page 239
;     WPFP = WPFP240       Write Protect Program Flash Page 240
;     WPFP = WPFP241       Write Protect Program Flash Page 241
;     WPFP = WPFP242       Write Protect Program Flash Page 242
;     WPFP = WPFP243       Write Protect Program Flash Page 243
;     WPFP = WPFP244       Write Protect Program Flash Page 244
;     WPFP = WPFP245       Write Protect Program Flash Page 245
;     WPFP = WPFP246       Write Protect Program Flash Page 246
;     WPFP = WPFP247       Write Protect Program Flash Page 247
;     WPFP = WPFP248       Write Protect Program Flash Page 248
;     WPFP = WPFP249       Write Protect Program Flash Page 249
;     WPFP = WPFP250       Write Protect Program Flash Page 250
;     WPFP = WPFP251       Write Protect Program Flash Page 251
;     WPFP = WPFP252       Write Protect Program Flash Page 252
;     WPFP = WPFP253       Write Protect Program Flash Page 253
;     WPFP = WPFP254       Write Protect Program Flash Page 254
;     WPFP = WPFP255       Write Protect Program Flash Page 255
;
;   Segment Write Protection Disable:
;     WPDIS = WPEN         Enabled
;     WPDIS = WPDIS        Disabled
;
;   Segment Write Protection End Page Select:
;     WPEND = WPSTARTMEM   write Protect from page 0 to WPFP
;     WPEND = WPENDMEM     Write Protect from WPFP to the last page of memory
;
;   Write Protect Configuration Page Select:
;     WPCFG = WPCFGEN      Enabled
;     WPCFG = WPCFGDIS     Disabled
;
;   TMR5 Gate Select bit:
;     T5GSEL = T3G         TMR5 Gate is driven by the T3G input
;     T5GSEL = T5G         TMR5 Gate is driven by the T5G input
;
;   CxINA Gate Select bit:
;     CINASEL = RA5        C1INA and C3INA are all re-mapped to pin RA5
;     CINASEL = DEFAULT    C1INA and C3INA are on their default pin locations
;
;   External Address Shift bit:
;     EASHFT = OFF         Address Shifting disabled
;     EASHFT = ON          Address Shifting enabled
;
;   Address Bus Width Select bits:
;     ABW = XM20           20-bit address bus
;     ABW = XM16           16-bit address bus
;     ABW = XM12           12-bit address bus
;     ABW = MM             8-bit address bus
;
;   Data Bus Width:
;     BW = 8               8-bit external bus mode
;     BW = 16              16-bit external bus mode
;
;   External Bus Wait:
;     WAIT = ON            Enabled
;     WAIT = OFF           Disabled
;
;   IOLOCK One-Way Set Enable bit:
;     IOL1WAY = OFF        the IOLOCK bit can be set and cleared using the unlock sequence
;     IOL1WAY = ON         Once set, the IOLOCK bit cannot be cleared
;
;   USB Low Speed Clock Select bit:
;     LS48MHZ = SYSX1      Divide-by-1 (System clock must be 6 MHz)
;     LS48MHZ = SYSX2      Divide-by-2 (System clock must be 12 MHz)
;
;   MSSP2 7-Bit Address Masking Mode Enable bit:
;     MSSPMSK2 = MSK5      5 Bit address masking mode
;     MSSPMSK2 = MSK7      7 Bit address masking mode
;
;   MSSP1 7-Bit Address Masking Mode Enable bit:
;     MSSPMSK1 = MSK5      5 bit address masking mode
;     MSSPMSK1 = MSK7      7 Bit address masking mode
;
;   Watch Dog Timer Window:
;     WDTWIN = PS75_0      Watch Dog Timer Window Width is 75 percent
;     WDTWIN = PS50_0      Watch Dog Timer Window Width is 50 percent
;     WDTWIN = PS37_5      Watch Dog Timer Window Width is 37.5 percent
;     WDTWIN = PS25_0      Watch Dog Timer Window Width is 25 percent
;
;   Watch Dog Timer Clock Source:
;     WDTCLK = SYS         Use FOSC/4 when system clock is not INTOSC/LPRC and device is not in Sleep; otherwise, use INTOSC/LPRC
;     WDTCLK = SOSC        Always use SOSC
;     WDTCLK = LPRC        Always use INTOSC/LPRC
;     WDTCLK = FRC         Use FRC when WINDIS = 0, system clock is not INTOSC/LPRC and device is not in Sleep; otherwise, use INTOSC/LPRC
;
;   Watchdog Timer Postscale:
;     WDTPS = 1            1:1
;     WDTPS = 2            1:2
;     WDTPS = 4            1:4
;     WDTPS = 8            1:8
;     WDTPS = 16           1:16
;     WDTPS = 32           1:32
;     WDTPS = 64           1:64
;     WDTPS = 128          1:128
;     WDTPS = 256          1:256
;     WDTPS = 512          1:512
;     WDTPS = 1024         1:1024
;     WDTPS = 2048         1:2048
;     WDTPS = 4096         1:4096
;     WDTPS = 8192         1:8192
;     WDTPS = 16384        1:16384
;     WDTPS = 32768        1:32768
;
;   Watchdog Timer Enable:
;     WDTEN = OFF          WDT disabled in hardware; SWDTEN bit disabled
;     WDTEN = NOSLP        WDT enabled only while device is active and disabled in Sleep mode; SWDTEN bit disabled
;     WDTEN = ON           WDT controlled by SWDTEN bit setting
;     WDTEN = SWDTDIS      WDT enabled in hardware; SWDTEN bit disabled
;
;   Windowed Watchdog Timer Disable:
;     WINDIS = WDTWIN      Windowed WDT enabled
;     WINDIS = WDTSTD      Standard WDT selected; windowed WDT disabled
;
;   WDT Prescaler:
